[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:47:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="me-auto">
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console </Nav.Link>
-                </>
-              )}
+              {false}
               {systemInfo?.showSwaggerUILink && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:60:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <NavDropdown
-                  title="Personal Schedules"
-                  id="appnavbar-personalschedules-dropdown"
-                  data-testid="appnavbar-personalschedules-dropdown"
-                >
-                  <NavDropdown.Item
-                    href="/personalschedules/list"
-                    data-testid="appnavbar-personalschedules-list"
-                  >
-                    All Schedules
-                  </NavDropdown.Item>
-                  <NavDropdown.Item
-                    href="/courses/list"
-                    data-testid="appnavbar-courses-list"
-                  >
-                    All Courses
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders the PersonalSchedules menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-personalschedules-dropdown"]

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:60:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <NavDropdown
-                  title="Personal Schedules"
-                  id="appnavbar-personalschedules-dropdown"
-                  data-testid="appnavbar-personalschedules-dropdown"
-                >
-                  <NavDropdown.Item
-                    href="/personalschedules/list"
-                    data-testid="appnavbar-personalschedules-list"
-                  >
-                    All Schedules
-                  </NavDropdown.Item>
-                  <NavDropdown.Item
-                    href="/courses/list"
-                    data-testid="appnavbar-courses-list"
-                  >
-                    All Courses
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests renders the PersonalSchedules menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-personalschedules-dropdown"]

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >
