[Killed] BlockStatement
main/components/Levels/SingleLevelDropdown.js:17:42
     localSearchLevel || "U",
   );
 
-  const handleLevelOnChange = (event) => {
-    const selectedLevel = event.target.value;
-    localStorage.setItem(controlId, selectedLevel);
-    setLevelState(selectedLevel);
-    setLevel(selectedLevel);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleLevelOnChange = (event) => {};
 
   return (
killedBy: BasicCourseSearchForm tests when I select a level, the state for level changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "G"
Received: "U"

[Killed] ConditionalExpression
main/components/Levels/SingleLevelDropdown.js:22:9
     localStorage.setItem(controlId, selectedLevel);
     setLevelState(selectedLevel);
     setLevel(selectedLevel);
-    if (onChange != null) {
+    if (true) {
       onChange(event);
     }
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TypeError: onChange is not a function

[Killed] ConditionalExpression
main/components/Levels/SingleLevelDropdown.js:22:9
     localStorage.setItem(controlId, selectedLevel);
     setLevelState(selectedLevel);
     setLevel(selectedLevel);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleLevelDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>
