[Killed] ArrayDeclaration
main/components/PersonalSections/PersonalSectionsEditTable.js:82:25
     },
   ];
 
-  const columnsIfUser = [
-    ...columns,
-    // Stryker disable all
-    ButtonColumn(
-      "Delete",
-      "danger",
-      deleteCallback,
-      "PersonalSectionsEditTable",
-    ),
-  ];
+  const columnsIfUser = [];
 
   const testid = "PersonalSectionsEditTable";
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalSectionsEditTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
