[Killed] BlockStatement
src/main/utils/CoursesEditUtils.js:8:57
   toast(message);
 }
 
-export function cellToAxiosParamsDelete({ cell, psId }) {
-  return {
-    url: "/api/courses/user/deleteByPsIdAndEnrollCd",
-    method: "DELETE",
-    params: {
-      psId: psId,
-      enrollCd: cell.row.values["classSections[0].enrollCode"],
-    },
-  };
-}
+export function cellToAxiosParamsDelete({ cell, psId }) {}
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally what happens when you click delete
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PSCourse with id 1 was deleted"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

<html>
