[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:46:65
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesForRangeOfQuartersJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.start_quarter}&end_quarterYYYYQ=${data.end_quarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesForRangeOfQuartersJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update course data for range of quarters job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:77:68
     updateCoursesByQuarterJobMutation.mutate(data);
   };
 
-  const submitUpdateCoursesForRangeOfQuartersJob = async (data) => {
-    updateCoursesForRangeOfQuartersJobMutation.mutate(data);
-  };
+  const submitUpdateCoursesForRangeOfQuartersJob = async (data) => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update course data for range of quarters job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
