[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:45:5
       Header: "Course Name",
       accessor: "courseName",
     },
-    {
-      Header: "Quarter",
-      accessor: "quarter",
-    }
+    {}
   ];
 
killedBy: CoursesIndexPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!
