[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:33:5
       Header: "Enrollment Code",
       accessor: "enrollCd",
     },
-    {
-      Header: "Personal Schedule ID",
-      accessor: "psId",
-    },
+    {},
     {
       Header: "Personal Schedule Name",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:35:17
     },
     {
       Header: "Personal Schedule ID",
-      accessor: "psId",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-psId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:37:5
       Header: "Personal Schedule ID",
       accessor: "psId",
     },
-    {
-      Header: "Personal Schedule Name",
-      accessor: "psName",
-    },
+    {},
     {
       Header: "Course Name",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:39:17
     },
     {
       Header: "Personal Schedule Name",
-      accessor: "psName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-psName"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:45:5
       Header: "Course Name",
       accessor: "courseName",
     },
-    {
-      Header: "Quarter",
-      accessor: "quarter",
-    },
+    {},
   ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:46:15
       accessor: "courseName",
     },
     {
-      Header: "Quarter",
+      Header: "",
       accessor: "quarter",
     },
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CourseTable.js:47:17
     },
     {
       Header: "Quarter",
-      accessor: "quarter",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
