[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:21:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/personalschedules/all"],
-    { method: "GET", url: "/api/personalschedules/all" },
+    { method: "", url: "/api/personalschedules/all" },
     [],
   );
killedBy: PersonalSchedulesIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/personalschedules/all"
Received string:    "useBackend: Error communicating with backend via  on /api/personalschedules/all: Error: timeout of 0ms exceeded"

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:26:37
   );
 
   const navigate = useNavigate();
-  const addScheduleCallback = () => {
-    navigate(`/personalschedules/create`);
-  };
+  const addScheduleCallback = () => {};
   const addCourseCallback = () => {
     navigate(`/courses/create`);
killedBy: PersonalSchedulesIndexPage tests both buttons navigate to the correct pages
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "/personalschedules/create"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:27:14
 
   const navigate = useNavigate();
   const addScheduleCallback = () => {
-    navigate(`/personalschedules/create`);
+    navigate(``);
   };
   const addCourseCallback = () => {
killedBy: PersonalSchedulesIndexPage tests both buttons navigate to the correct pages
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "/personalschedules/create"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:29:35
   const addScheduleCallback = () => {
     navigate(`/personalschedules/create`);
   };
-  const addCourseCallback = () => {
-    navigate(`/courses/create`);
-  };
+  const addCourseCallback = () => {};
 
   return (
killedBy: PersonalSchedulesIndexPage tests both buttons navigate to the correct pages
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "/courses/create"
Received: "/personalschedules/create"

Number of calls: 1

<html>
