[Killed] StringLiteral
main/components/Sections/SectionsTable.js:31:64
   // Stryker disable BooleanLiteral
   const [showModal, setShowModal] = useState(false);
   const [fetchSchedules, setFetchSchedules] = useState(false);
-  const [selectedEnrollCode, setSelectedEnrollCode] = useState("");
+  const [selectedEnrollCode, setSelectedEnrollCode] = useState("Stryker was here!");
 
   const handleShow = () => {
killedBy: Section tests sets schedule and updates localStorage when schedules are available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "17"
Received: null

<html>
  <head />
  <body

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:33:28
   const [fetchSchedules, setFetchSchedules] = useState(false);
   const [selectedEnrollCode, setSelectedEnrollCode] = useState("");
 
-  const handleShow = () => {
-    setShowModal(true);
-    setFetchSchedules(true);
-  };
+  const handleShow = () => {};
   const handleClose = () => {
     setShowModal(false);
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ModalForm-enrollCd"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:37:29
     setShowModal(true);
     setFetchSchedules(true);
   };
-  const handleClose = () => {
-    setShowModal(false);
-    setFetchSchedules(false);
-  };
+  const handleClose = () => {};
 
   const {
killedBy: Section tests Modal displays on add button click
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Add Section to Schedule</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:64:19
   }
   // Stryker restore all
 
-  useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
-      setSchedule(schedules[0].id);
-      // Stryker disable all : not sure how to test/mock local storage
-      localStorage.setItem("ModalForm-psId", schedules[0].id);
-      // Stryker restore all
-    }
-  }, [schedules, localSchedule]);
+  useEffect(() => {}, [schedules, localSchedule]);
 
   const objectToAxiosParams = (course) => ({
killedBy: Section tests sets schedule and updates localStorage when schedules are available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "17"
Received: null

<html>
  <head />
  <body

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:65:62
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
-      setSchedule(schedules[0].id);
-      // Stryker disable all : not sure how to test/mock local storage
-      localStorage.setItem("ModalForm-psId", schedules[0].id);
-      // Stryker restore all
-    }
+    if (schedules && schedules.length > 0 && !localSchedule) {}
   }, [schedules, localSchedule]);
 
killedBy: Section tests sets schedule and updates localStorage when schedules are available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "17"
Received: null

<html>
  <head />
  <body

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:247:24
               <Form.Label>Enroll Code</Form.Label>
               <Form.Control
                 type="text"
-                value={selectedEnrollCode || ""}
+                value={true}
                 readOnly
               />
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveValue(12609)

Expected the element to have value:
  12609
Received:
  true

[Killed] LogicalOperator
main/components/Sections/SectionsTable.js:247:24
               <Form.Label>Enroll Code</Form.Label>
               <Form.Control
                 type="text"
-                value={selectedEnrollCode || ""}
+                value={selectedEnrollCode && ""}
                 readOnly
               />
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveValue(12609)

Expected the element to have value:
  12609
Received:

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:256:28
                 schedules={schedules}
                 schedule={schedule}
                 setSchedule={setSchedule}
-                controlId={"ModalForm-psId"}
+                controlId={""}
               />
             </Form.Group>
killedBy: Section tests when you fill in the form and hit submit, it makes a request to the backend (with sections)
statusReason: Error: Unable to fire a "change" event - please provide a DOM element.

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:267:28
           </Button>
           <Button
             variant="primary"
-            onClick={() => {
-              // Implement the logic to add the section to a schedule here
-              saveCallback();
-              handleClose();
-            }}
+            onClick={() => {}}
           >
             Save Changes
killedBy: Section tests when you fill in the form and hit submit, it makes a request to the backend (with sections)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body
