[Killed] ArrowFunction
src/main/components/SectionsTableBase.js:13:5
   addCallback,
 }) {
   const extendedColumns = React.useMemo(
-    () => [
-      ...columns,
-      {
-        id: "addAction",
-        Header: "Add Section",
-        Cell: ({ row }) => {
-          if (row.original || (!row.original && row.subRows.length === 1)) {
-            return (
-              <Button
-                onClick={() => addCallback(row.original ? row.original : row)}
-              >
-                Add
-              </Button>
-            );
-          }
-          return null;
-        },
-      },
-    ],
+    () => undefined,
     [columns, addCallback],
   );
killedBy: Section tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/main/components/SectionsTableBase.js:18:28
       {
         id: "addAction",
         Header: "Add Section",
-        Cell: ({ row }) => {
-          if (row.original || (!row.original && row.subRows.length === 1)) {
-            return (
-              <Button
-                onClick={() => addCallback(row.original ? row.original : row)}
-              >
-                Add
-              </Button>
-            );
-          }
-          return null;
-        },
+        Cell: ({ row }) => {},
       },
     ],
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/main/components/SectionsTableBase.js:19:76
         id: "addAction",
         Header: "Add Section",
         Cell: ({ row }) => {
-          if (row.original || (!row.original && row.subRows.length === 1)) {
-            return (
-              <Button
-                onClick={() => addCallback(row.original ? row.original : row)}
-              >
-                Add
-              </Button>
-            );
-          }
+          if (row.original || (!row.original && row.subRows.length === 1)) {}
           return null;
         },
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:19:15
         id: "addAction",
         Header: "Add Section",
         Cell: ({ row }) => {
-          if (row.original || (!row.original && row.subRows.length === 1)) {
+          if (row.original && !row.original && row.subRows.length === 1) {
             return (
               <Button
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
src/main/components/SectionsTableBase.js:22:26
           if (row.original || (!row.original && row.subRows.length === 1)) {
             return (
               <Button
-                onClick={() => addCallback(row.original ? row.original : row)}
+                onClick={() => undefined}
               >
                 Add
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ModalForm-enrollCd"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
