[Timeout] BooleanLiteral
src/main/utils/useBackend.js:32:15
   queryKey,
   axiosParameters,
   initialData,
-  { enabled = true, ...rest } = {},
+  { enabled = false, ...rest } = {},
 ) {
   return useQuery({

[Killed] BlockStatement
src/main/utils/useBackend.js:33:3
   axiosParameters,
   initialData,
   { enabled = true, ...rest } = {},
-) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
-        console.error(errorMessage);
-        throw e;
-      }
-    },
-    onError: (e) => {
-      const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
-      console.error(errorMessage);
-    },
-    initialData: initialData,
-    enabled,
-    ...rest,
-  });
-}
+) {}
 
 const wrappedParams = async (params) => {
killedBy: Section tests renders without crashing for empty table
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] ObjectLiteral
src/main/utils/useBackend.js:34:19
   initialData,
   { enabled = true, ...rest } = {},
 ) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `useBackend: Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-        toast(errorMessage, { type: "error" });
-        console.error(errorMessage);
-        throw e;
-      }
-    },
-    onError: (e) => {
-      const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
-      console.error(errorMessage);
-    },
-    initialData: initialData,
-    enabled,
-    ...rest,
-  });
+  return useQuery({});
 }
 
killedBy: Section tests Has the expected column headers and content
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/main/utils/useBackend.js:49:35
     },
     onError: (e) => {
       const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}: ${e}`;
-      toast(errorMessage, { type: "error" });
+      toast(errorMessage, { type: "" });
       console.error(errorMessage);
     },
killedBy: Section tests sets schedule and updates localStorage when schedules are available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "17"
Received: null

<html>
  <head />
  <body
